# -*- coding: utf-8 -*-
require 'rubygems'
require 'mechanize'
agent = Mechanize::new
agent.user_agent_alias = 'Windows IE 7'

# 検索する用語を配列 words として準備
words = ["北部仏印進駐", "援蒋ルート", "日独伊三国同盟", "ABCDライン", "日米交渉", "野村吉三郎", "来栖三郎", "ハル", "ハル＝ノート", "グルー", "豊田貞次郎", "日ソ中立条約", "独ソ戦争", "イギリス・ソ連相互援助協定", "大西洋憲章", "関東軍特種演習", "近衛内閣（第三次）", "南進政策", "南部仏印進駐", "帝国国策遂行要領", "御前会議", "東条英機", "東条内閣", "太平洋戦争", "真珠湾攻撃", "マレー半島上陸", "シンガポール華僑虐殺事件", "翼賛選挙", "翼賛政治会", "大日本政治会", "食糧管理法", "軍需省", "軍政", "軍票", "大東亜共栄圏", "大東亜会議", "自由インド仮政府", "バターン死の行進", "泰緬鉄道", "731部隊", "毒ガス", "満州帝国協和会", "皇民化政策", "南次郎", "皇国臣民の誓詞", "創氏改名", "朝鮮人の強制連行", "従軍慰安婦問題", "中国人の強制連行", "三光作戦", "抗日運動", "反戦同盟", "国民勤労動員令", "国民勤労報国協力令", "勤労動員", "学徒勤労動員", "女子挺身隊", "学徒出陣", "国民義勇隊", "陸軍志願兵制度", "皇民奉仕会", "高砂族", "ミッドウェー海戦", "アッツ島戦", "ガダルカナル島戦", "インパール戦", "マリアナ沖海戦", "サイパン諸島", "レイテ島海戦", "特別攻撃隊", "硫黄島の戦い", "沖縄戦", "鉄血勤皇隊", "ひめゆり隊", "太田実", "牛島満", "対馬丸", "戦艦大和", "本土空襲", "東京大空襲", "学童疎開", "本土決戦", "小磯國昭", "小磯内閣", "最高戦争指導会議", "近衛上奏文", "終戦工作", "カイロ宣言", "ローズヴェルト", "チャーチル", "テヘラン会議", "イタリアの降伏", "ヤルタ協定", "スターリン", "鈴木貫太郎", "鈴木貫太郎内閣", "ドイツ降伏", "ポツダム宣言", "原子爆弾", "ソ連の対日参戦", "シベリア抑留", "無条件降伏", "終戦の詔勅", "降伏文書調印", "重光葵", "日本分割占領計画", "大東亜戦争全史", "戸坂潤", "傾向映画", "五所平之助", "清沢洌", "正木ひろし", "桐生悠々", "吉田富三", "桜田一郎", "釈迢空", "金子光晴", "宮柊二", "亀井勝一郎", "保田与重郎", "皇国史観", "日本文学報国会", "大日本言論報国会", "高見順", "阿部知二", "武田麟太郎", "小林秀雄", "伊藤整", "丹羽文雄", "堀辰雄", "火野葦平", "石川達三", "軽演劇", "エロ・グロ・ナンセンス", "榎本健一", "カジノ＝フォーリー", "古川緑波", "プロレタリア演劇", "前進座", "島田正吾", "辰巳柳太郎", "宇野重吉", "杉村春子", "山本安英", "西条八十", "古賀政男", "軍歌", "日本美術報国会", "靉光", "松本竣介", "新人画会", "大東亜戦争美術展", "宗教団体法", "灯台社", "大本教", "ひとのみち教団", "創価教育学会", "横浜事件", "人口政策要項", "金属類回収令", "千人針", "国民服", "木炭自動車", "ルース・ベネディクト", "強制収容所", "満鉄特急あじあ号", "水豊発電所", "銃後"]
# 配列 words の最後まで繰り返し処理
words.each{|word|
  # Google で検索する準備
  agent.get('http://www.google.co.jp/')
  # Google で変数 word を検索
  agent.page.form_with(:name => 'f'){|form|
    form.field_with(:name => 'q').value = word
    form.click_button
  }
  # 一番上の検索結果の URL を取得
  url =  agent.page.at("a[@class='l']")['href']
  # 一番上の検索結果にアクセス
  begin
  agent.get(url)
  # 例外処理
  rescue TimeoutError
    puts "TimeoutError"
  rescue Mechanize::ResponseCodeError => exception
    case exception.response_code
    when '404' then
      puts "404"
    when '503' then
      puts "503"
    when '403' then
      puts "403"
    else
      puts "unkown exception"
    end
  end
  # アクセス先の URL を表示
  puts agent.page.uri
  sleep 5
}

